#### ShapeImporter Members

---

|  |
| --- |
| ShapeImporter Class   Constructors   Methods   Properties   See Also |

The  ShapeImporter  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ShapeImporter | Default constructor. Initializes an instance of ShapeImporter that will automatically recognize the file format from its extension (ShapeImporterSourceFormat.Auto). |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Convert | Converts the geometry stored in the external format into a collection of Revit geometry objects. |
| Public method | Dispose | Releases all resources used by the  ShapeImporter |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method Static member | IsServiceAvailable | Checks whether the data conversion service is available. |
| Public method | SetDefaultLengthUnit | Sets the length unit to be used when the input is a unitless SAT file. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | DefaultLengthUnit | The length unit to be used if not specified when the input is a unitless SAT file. |
| Public property | InputFormat | The format of the incoming data. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

ShapeImporter Class

Autodesk.Revit.DB Namespace